# NavisworksExportOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NavisworksExportOptions Methods
NavisworksExportOptions Class See Also
---
The NavisworksExportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSelectedElementIds | Returns the element ids of the elements to export. Empty by default. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetSelectedElementIds | Sets the element ids of the elements to export. Used only when ExportScope = SelectedElements. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace